server/app/Controllers/Api/V1/Leads.php

    public function show(int $id)
    {
        $lead = $this->leadModel->find($id);
---
SELECT *
FROM `leads`
WHERE `leads`.`id` = 1