server/app/Models/LeadEventModel.php

SELECT *
FROM `lead_events`
WHERE `lead_id` = 1
ORDER BY `created_at` ASC
---
    public function getEventsForLead(int $leadId): array
    {
        return $this->where('lead_id', $leadId)
            ->orderBy('created_at', 'ASC')
            ->get()
            ->getResultArray();