server/app/Models/LeadModel.php

    public function getLeads(int $page = 1, int $perPage = 20, ?string $search = null): array
    {
        $builder = $this->builder();

        if ($search !== null && $search !== '') {
            $builder->groupStart()
                ->like('full_name', $search)
                ->orLike('email', $search)
                ->orLike('contact_number', $search)
                ->orLike('business_name', $search)
                ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $leads = $builder
            ->orderBy('created_at', 'DESC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `leads`
SELECT *
FROM `leads`
ORDER BY `created_at` DESC
 LIMIT 20