server/app/Models/SettingsModel.php

    public function getPublicSettings(): array
    {
        $publicKeys = ['calendly_url', 'ai_provider', 'recaptcha_site_key'];
        $rows = $this->findAll();
---
SELECT *
FROM `settings`